{"intents": [
        {"tag": "greetings",
        "patterns": ["hello","hey","hi","good day","Greetings","what's up?","how is it going?"],
        "responses": ["Hello!","Hey!","What can I do for you?"]
        },
      
        {"tag": "name",
        "patterns": ["what is your name","name","what's your name","who are you","what should I call you"],
        "responses": ["I'm BVCOE's bot","I'm BVCOEian your virtual assistant chatbot"]
        },
      
        {"tag": "courses",
        "patterns": ["what courses are available", "how many courses are there in this college"],
        "responses": ["Bharati Vidyapeeth College of Engineering has been in direct partnership with Mumbai University. \nFor, Bachelors Degree in Information Technology we have been offering the specialization in BE."]
        },
      
         {"tag": "courseDuration",
        "patterns": ["how long will be BE course", "how long will it take to complete BE course"],
        "responses": ["Our college offers 4 year BE course."]
        },
      
         {"tag": "Location",
        "patterns": ["location","where it is located","how long will be BE course"],
        "responses": ["Bharati Vidyapeeth College of Engineering is located in Navi Mumbai, Maharahtra."]
        },
      
        {"tag": "semesters",
        "patterns": ["how many semesters are there?","how many semesters one should study?"],
        "responses": ["There are eight semesters in a year."]
        },
      
        {"tag": "semDuration",
        "patterns": ["how many months are there in a semester","how long will be a single semester"],
        "responses": ["The single semester will be around 6 months."]
        },
      
        {"tag": "studentRequirements",
        "patterns": ["what are the student requirements for admission","entry requirements","admission requirements"],
        "responses": ["Academic Level: 10+2, overall aggregate of 55% or above in each subject (theory and practical) with grade D+ or above and JEE Main score of 60 and above. \n Also you need MH-CET score of 120 and above to get admission."]
        },
      
        {"tag": "classes",
        "patterns": ["how many classes will be there in a day","how long are the classes?"],
        "responses": ["There may be 7 classes per day. Each class will be of 1 hour."]
        },
      
        {"tag": "teachingStyle",
        "patterns": ["what is the teaching style of this college?","Is the teaching pattern different from other college?","what is the teaching format?"],
        "responses": ["Our college has different teaching patterns than other colleges of Mumbai. We are following Social Transformation through Dynamic Education for Lecture, Tutorial and Workshop.\nYou can provide us with your contact details and our counselors shall reach out to you and provide you with further details."]
        },
      
        {"tag": "exams",
        "patterns": ["what are the exams like?","What is the exam pattern"],
        "responses": ["There are assignments which carry more weight than your written exams. The assignments have deadlines which you should not exceed if you want to get better marks."]
        },
      
        {"tag": "hours",
        "patterns": ["what are your hours","when are you guys open","what your hours of operation"],
        "responses": ["You can message us here at any hours. But our college premises will be open from 9:00 am to 5:00 pm only."]
        },
      
        {"tag": "funActivities",
        "patterns": ["will there be any extra curriculum activities?","does the college conducts any fun program"],
        "responses": ["Yes, Of course. Our college not only provides excellent education but also encourage students to take part in different curriculum activities. The college conducts yearly programs like Sports meet, Carnival, Holi festival, and Christmas. \n Also our college has basketball court, badminton court, table tennis, chess, carrom board and many more refreshment zones."]
        },
      
        {"tag": "facilities",
        "patterns": ["what facilities are provided by the college?","what are the facilities of college for students", "what are the college infrastructures "],
        "responses": ["With excellent education facilities, Our College provides various other facilities like 24 hours internet, library, classes with AC, discusson room, canteen, parking space, and student service for any students queries."]
        },
      
        
        {"tag": "goodbye",
        "patterns": ["cya","See you later","Goodbye","I am leaving","Have a Good Day","bye","see ya"],
        "responses": ["Sad to see you go :(","Talk you later","Goodbye"]
        },
      
        {"tag": "invalid",
          "patterns": [" ","gvsd","asbhk"],
          "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand"]
        },
      
        {"tag": "thanks",
          "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
          "responses": ["Happy to help!", "Any time!", "My pleasure"]
        }
      ]}